---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings)
source: html/e2f4a7b5-274e-5e2a-122a-414130061931.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.#ctor Method

Constructs a new copy of the input AnalysisDisplayVectorSettings object.

## Syntax (C#)
```csharp
public AnalysisDisplayVectorSettings(
	AnalysisDisplayVectorSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null